/****************************************************
作者信息：
	姓名：董逸箫   学号：20281205   班级：计算机2007班  学院：计算机
     Email: 20281205@bjtu.edu.cn            电话：13519570701
版权声明：
	版权由董逸箫所有，除老师外，未经允许不得拷贝本人作业
模块名称: 
      程序设计 实验3
摘要:
  	本模块是 实验3交付物
其它说明:

模块历史:
	董逸箫于2021年4月8日创建本模块，email: 20281205@bjtu.edu.cn
****************************************************/
#include "Lab3_run.h"

/*
*函数名称：main
*函数功能：
*输入参数：int argc：命令行参数个数, char* argv[]:命令行参数值
*返回值：无
*版本信息：create by 董逸箫，2021-04-08
*/
int main(int argc, char *argv[])
{
    Run(argc, argv);
    return 0;
}